app/controllers/direct_connect_programs_controller.rb

    def create
        @direct_connect_program = DirectConnectProgram.create!(agencies_params)
---
INSERT INTO "direct_connect_programs" ("ColdFoodTransport") VALUES ($1) RETURNING "id"  [["ColdFoodTransport", ""]]