app/controllers/ef_programs_controller.rb

INSERT INTO "ef_programs" ("DocumentsRequested", "PurposeForRequestingDocumentation") VALUES ($1, $2) RETURNING "id"  [["DocumentsRequested", ""], ["PurposeForRequestingDocumentation", ""]]
---
    def create
        @ef_program = EfProgram.create!(agencies_params)