app/controllers/fb_agencies_controller.rb

  def create
    @wizard = ModelWizard.new(FbAgency, session, params, agencies_params).continue
    @fb_agency = @wizard.object
    if @wizard.save
---
INSERT INTO "fb_agencies" ("AgencyName", "AgencyCounty", "TodaysDate", "DofLastMonitor", "ParentAgency", "PAgencyNum", "SiteAddress", "ContactName", "Director", "AdditionalContact", "PrimaryEmail", "DateOfVerification", "DateOfContract", "PersonInterviewed", "DaysOfOperation") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"