app/controllers/food_safeties_controller.rb

    def create
        @food_safety = FoodSafety.create!(agencies_params)
---
INSERT INTO "food_safeties" ("PermitDate", "PermitScore", "PestControlCompany", "AdditionalStorage") VALUES ($1, $2, $3, $4) RETURNING "id"  [["PermitDate", ""], ["PermitScore", ""], ["PestControlCompany", ""], ["AdditionalStorage", ""]]