app/controllers/grocery_plans_controller.rb

INSERT INTO "grocery_plans" ("OtherDistributonUtilized", "FequencyHouseholdCanRecieveFood", "AvgNumPeopleServered", "FoodPerHousehold", "FSCAttendeeName", "FSCDate", "FoodAssistanceRequirements") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @grocery_plan = GroceryPlan.create!(agencies_params)