app/controllers/meal_programs_controller.rb

INSERT INTO "meal_programs" ("CertificationName", "FeesExplained", "FundingSource", "FoodAssistanceRequirements", "MealPrepParticipation") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["CertificationName", ""], ["FeesExplained", ""], ["FundingSource", ""], ["FoodAssistanceRequirements", ""], ["MealPrepParticipation", ""]]
---
    def create
        @meal_program = MealProgram.create!(agencies_params)