app/controllers/part_six_forms_controller.rb

    def create
        @part_six_form = PartSixForm.create!(agencies_params)
---
INSERT INTO "part_six_forms" DEFAULT VALUES RETURNING "id"