app/controllers/part_seven_eight_forms_controller.rb

INSERT INTO "part_seven_eight_forms" ("Violations", "DigitalSignNIFBRep", "DateOfDSNIFBRep", "DigitalSignAgencyRep") VALUES ($1, $2, $3, $4) RETURNING "id"  [["Violations", ""], ["DigitalSignNIFBRep", ""], ["DateOfDSNIFBRep", ""], ["DigitalSignAgencyRep", ""]]
---
    def create
        @part_seven_eight_form = PartSevenEightForm.create!(agencies_params)